Revit 2027 API
ColorFillSchemeEntry Constructor
 Creates new ColorFillSchemeEntry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ColorFillSchemeEntry(
	StorageType storageType
)
Public Sub New (
	storageType As StorageType
)
public:
ColorFillSchemeEntry(
	StorageType storageType
)
new :
        storageType : StorageType -> ColorFillSchemeEntry
Parameters
storageType StorageType
 The type of data that could be stored into this entry.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 A new created ColorFillSchemeEntry should be assigned proper value before it is applied to a [!:Autodesk::Revit::DB::ColorFillScheme]. If the Color and Caption properties are not set, Revit will generate them automatically after the ColorFillSchemeEntry is applied to the ColorFillScheme.
See Also
Reference
ColorFillSchemeEntry Class
Autodesk.Revit.DB Namespace